; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p16---int100n150-m25---int100c150---s532---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 - fuellevel
)

(:init
(sum level0 level7 level7)
(sum level0 level9 level9)
(sum level0 level13 level13)
(sum level0 level15 level15)
(sum level0 level19 level19)
(sum level1 level7 level8)
(sum level1 level9 level10)
(sum level1 level13 level14)
(sum level1 level15 level16)
(sum level1 level19 level20)
(sum level2 level7 level9)
(sum level2 level9 level11)
(sum level2 level13 level15)
(sum level2 level15 level17)
(sum level2 level19 level21)
(sum level3 level7 level10)
(sum level3 level9 level12)
(sum level3 level13 level16)
(sum level3 level15 level18)
(sum level3 level19 level22)
(sum level4 level7 level11)
(sum level4 level9 level13)
(sum level4 level13 level17)
(sum level4 level15 level19)
(sum level4 level19 level23)
(sum level5 level7 level12)
(sum level5 level9 level14)
(sum level5 level13 level18)
(sum level5 level15 level20)
(sum level5 level19 level24)
(sum level6 level7 level13)
(sum level6 level9 level15)
(sum level6 level13 level19)
(sum level6 level15 level21)
(sum level6 level19 level25)
(sum level7 level7 level14)
(sum level7 level9 level16)
(sum level7 level13 level20)
(sum level7 level15 level22)
(sum level7 level19 level26)
(sum level8 level7 level15)
(sum level8 level9 level17)
(sum level8 level13 level21)
(sum level8 level15 level23)
(sum level8 level19 level27)
(sum level9 level7 level16)
(sum level9 level9 level18)
(sum level9 level13 level22)
(sum level9 level15 level24)
(sum level9 level19 level28)
(sum level10 level7 level17)
(sum level10 level9 level19)
(sum level10 level13 level23)
(sum level10 level15 level25)
(sum level10 level19 level29)
(sum level11 level7 level18)
(sum level11 level9 level20)
(sum level11 level13 level24)
(sum level11 level15 level26)
(sum level11 level19 level30)
(sum level12 level7 level19)
(sum level12 level9 level21)
(sum level12 level13 level25)
(sum level12 level15 level27)
(sum level12 level19 level31)
(sum level13 level7 level20)
(sum level13 level9 level22)
(sum level13 level13 level26)
(sum level13 level15 level28)
(sum level13 level19 level32)
(sum level14 level7 level21)
(sum level14 level9 level23)
(sum level14 level13 level27)
(sum level14 level15 level29)
(sum level14 level19 level33)
(sum level15 level7 level22)
(sum level15 level9 level24)
(sum level15 level13 level28)
(sum level15 level15 level30)
(sum level15 level19 level34)
(sum level16 level7 level23)
(sum level16 level9 level25)
(sum level16 level13 level29)
(sum level16 level15 level31)
(sum level16 level19 level35)
(sum level17 level7 level24)
(sum level17 level9 level26)
(sum level17 level13 level30)
(sum level17 level15 level32)
(sum level17 level19 level36)
(sum level18 level7 level25)
(sum level18 level9 level27)
(sum level18 level13 level31)
(sum level18 level15 level33)
(sum level18 level19 level37)
(sum level19 level7 level26)
(sum level19 level9 level28)
(sum level19 level13 level32)
(sum level19 level15 level34)
(sum level19 level19 level38)
(sum level20 level7 level27)
(sum level20 level9 level29)
(sum level20 level13 level33)
(sum level20 level15 level35)
(sum level20 level19 level39)
(sum level21 level7 level28)
(sum level21 level9 level30)
(sum level21 level13 level34)
(sum level21 level15 level36)
(sum level21 level19 level40)
(sum level22 level7 level29)
(sum level22 level9 level31)
(sum level22 level13 level35)
(sum level22 level15 level37)
(sum level22 level19 level41)
(sum level23 level7 level30)
(sum level23 level9 level32)
(sum level23 level13 level36)
(sum level23 level15 level38)
(sum level23 level19 level42)
(sum level24 level7 level31)
(sum level24 level9 level33)
(sum level24 level13 level37)
(sum level24 level15 level39)
(sum level24 level19 level43)
(sum level25 level7 level32)
(sum level25 level9 level34)
(sum level25 level13 level38)
(sum level25 level15 level40)
(sum level25 level19 level44)
(sum level26 level7 level33)
(sum level26 level9 level35)
(sum level26 level13 level39)
(sum level26 level15 level41)
(sum level26 level19 level45)
(sum level27 level7 level34)
(sum level27 level9 level36)
(sum level27 level13 level40)
(sum level27 level15 level42)
(sum level27 level19 level46)
(sum level28 level7 level35)
(sum level28 level9 level37)
(sum level28 level13 level41)
(sum level28 level15 level43)
(sum level28 level19 level47)
(sum level29 level7 level36)
(sum level29 level9 level38)
(sum level29 level13 level42)
(sum level29 level15 level44)
(sum level29 level19 level48)
(sum level30 level7 level37)
(sum level30 level9 level39)
(sum level30 level13 level43)
(sum level30 level15 level45)
(sum level30 level19 level49)
(sum level31 level7 level38)
(sum level31 level9 level40)
(sum level31 level13 level44)
(sum level31 level15 level46)
(sum level31 level19 level50)
(sum level32 level7 level39)
(sum level32 level9 level41)
(sum level32 level13 level45)
(sum level32 level15 level47)
(sum level32 level19 level51)
(sum level33 level7 level40)
(sum level33 level9 level42)
(sum level33 level13 level46)
(sum level33 level15 level48)
(sum level33 level19 level52)
(sum level34 level7 level41)
(sum level34 level9 level43)
(sum level34 level13 level47)
(sum level34 level15 level49)
(sum level34 level19 level53)
(sum level35 level7 level42)
(sum level35 level9 level44)
(sum level35 level13 level48)
(sum level35 level15 level50)
(sum level35 level19 level54)
(sum level36 level7 level43)
(sum level36 level9 level45)
(sum level36 level13 level49)
(sum level36 level15 level51)
(sum level36 level19 level55)
(sum level37 level7 level44)
(sum level37 level9 level46)
(sum level37 level13 level50)
(sum level37 level15 level52)
(sum level37 level19 level56)
(sum level38 level7 level45)
(sum level38 level9 level47)
(sum level38 level13 level51)
(sum level38 level15 level53)
(sum level38 level19 level57)
(sum level39 level7 level46)
(sum level39 level9 level48)
(sum level39 level13 level52)
(sum level39 level15 level54)
(sum level39 level19 level58)
(sum level40 level7 level47)
(sum level40 level9 level49)
(sum level40 level13 level53)
(sum level40 level15 level55)
(sum level40 level19 level59)
(sum level41 level7 level48)
(sum level41 level9 level50)
(sum level41 level13 level54)
(sum level41 level15 level56)
(sum level41 level19 level60)
(sum level42 level7 level49)
(sum level42 level9 level51)
(sum level42 level13 level55)
(sum level42 level15 level57)
(sum level42 level19 level61)
(sum level43 level7 level50)
(sum level43 level9 level52)
(sum level43 level13 level56)
(sum level43 level15 level58)
(sum level43 level19 level62)
(sum level44 level7 level51)
(sum level44 level9 level53)
(sum level44 level13 level57)
(sum level44 level15 level59)
(sum level44 level19 level63)
(sum level45 level7 level52)
(sum level45 level9 level54)
(sum level45 level13 level58)
(sum level45 level15 level60)
(sum level45 level19 level64)
(sum level46 level7 level53)
(sum level46 level9 level55)
(sum level46 level13 level59)
(sum level46 level15 level61)
(sum level46 level19 level65)
(sum level47 level7 level54)
(sum level47 level9 level56)
(sum level47 level13 level60)
(sum level47 level15 level62)
(sum level47 level19 level66)
(sum level48 level7 level55)
(sum level48 level9 level57)
(sum level48 level13 level61)
(sum level48 level15 level63)
(sum level48 level19 level67)
(sum level49 level7 level56)
(sum level49 level9 level58)
(sum level49 level13 level62)
(sum level49 level15 level64)
(sum level49 level19 level68)
(sum level50 level7 level57)
(sum level50 level9 level59)
(sum level50 level13 level63)
(sum level50 level15 level65)
(sum level50 level19 level69)
(sum level51 level7 level58)
(sum level51 level9 level60)
(sum level51 level13 level64)
(sum level51 level15 level66)
(sum level51 level19 level70)
(sum level52 level7 level59)
(sum level52 level9 level61)
(sum level52 level13 level65)
(sum level52 level15 level67)
(sum level52 level19 level71)
(sum level53 level7 level60)
(sum level53 level9 level62)
(sum level53 level13 level66)
(sum level53 level15 level68)
(sum level53 level19 level72)
(sum level54 level7 level61)
(sum level54 level9 level63)
(sum level54 level13 level67)
(sum level54 level15 level69)
(sum level54 level19 level73)
(sum level55 level7 level62)
(sum level55 level9 level64)
(sum level55 level13 level68)
(sum level55 level15 level70)
(sum level55 level19 level74)
(sum level56 level7 level63)
(sum level56 level9 level65)
(sum level56 level13 level69)
(sum level56 level15 level71)
(sum level56 level19 level75)
(sum level57 level7 level64)
(sum level57 level9 level66)
(sum level57 level13 level70)
(sum level57 level15 level72)
(sum level57 level19 level76)
(sum level58 level7 level65)
(sum level58 level9 level67)
(sum level58 level13 level71)
(sum level58 level15 level73)
(sum level58 level19 level77)
(sum level59 level7 level66)
(sum level59 level9 level68)
(sum level59 level13 level72)
(sum level59 level15 level74)
(sum level59 level19 level78)
(sum level60 level7 level67)
(sum level60 level9 level69)
(sum level60 level13 level73)
(sum level60 level15 level75)
(sum level60 level19 level79)
(sum level61 level7 level68)
(sum level61 level9 level70)
(sum level61 level13 level74)
(sum level61 level15 level76)
(sum level61 level19 level80)
(sum level62 level7 level69)
(sum level62 level9 level71)
(sum level62 level13 level75)
(sum level62 level15 level77)
(sum level62 level19 level81)
(sum level63 level7 level70)
(sum level63 level9 level72)
(sum level63 level13 level76)
(sum level63 level15 level78)
(sum level63 level19 level82)
(sum level64 level7 level71)
(sum level64 level9 level73)
(sum level64 level13 level77)
(sum level64 level15 level79)
(sum level64 level19 level83)
(sum level65 level7 level72)
(sum level65 level9 level74)
(sum level65 level13 level78)
(sum level65 level15 level80)
(sum level65 level19 level84)
(sum level66 level7 level73)
(sum level66 level9 level75)
(sum level66 level13 level79)
(sum level66 level15 level81)
(sum level66 level19 level85)
(sum level67 level7 level74)
(sum level67 level9 level76)
(sum level67 level13 level80)
(sum level67 level15 level82)
(sum level67 level19 level86)
(sum level68 level7 level75)
(sum level68 level9 level77)
(sum level68 level13 level81)
(sum level68 level15 level83)
(sum level68 level19 level87)
(sum level69 level7 level76)
(sum level69 level9 level78)
(sum level69 level13 level82)
(sum level69 level15 level84)
(sum level70 level7 level77)
(sum level70 level9 level79)
(sum level70 level13 level83)
(sum level70 level15 level85)
(sum level71 level7 level78)
(sum level71 level9 level80)
(sum level71 level13 level84)
(sum level71 level15 level86)
(sum level72 level7 level79)
(sum level72 level9 level81)
(sum level72 level13 level85)
(sum level72 level15 level87)
(sum level73 level7 level80)
(sum level73 level9 level82)
(sum level73 level13 level86)
(sum level74 level7 level81)
(sum level74 level9 level83)
(sum level74 level13 level87)
(sum level75 level7 level82)
(sum level75 level9 level84)
(sum level76 level7 level83)
(sum level76 level9 level85)
(sum level77 level7 level84)
(sum level77 level9 level86)
(sum level78 level7 level85)
(sum level78 level9 level87)
(sum level79 level7 level86)
(sum level80 level7 level87)

(connected l0 l1)
(fuelcost level9 l0 l1)
(connected l0 l2)
(fuelcost level13 l0 l2)
(connected l0 l3)
(fuelcost level15 l0 l3)
(connected l1 l0)
(fuelcost level9 l1 l0)
(connected l1 l2)
(fuelcost level19 l1 l2)
(connected l1 l3)
(fuelcost level13 l1 l3)
(connected l2 l0)
(fuelcost level13 l2 l0)
(connected l2 l1)
(fuelcost level19 l2 l1)
(connected l2 l3)
(fuelcost level7 l2 l3)
(connected l3 l0)
(fuelcost level15 l3 l0)
(connected l3 l1)
(fuelcost level13 l3 l1)
(connected l3 l2)
(fuelcost level7 l3 l2)

(at t0 l3)
(fuel t0 level87)
(= (total-cost) 0)

(at p0 l3)
(at p1 l3)
(at p2 l0)
(at p3 l2)
(at p4 l1)
(at p5 l0)
(at p6 l0)
(at p7 l1)
(at p8 l2)
(at p9 l3)
(at p10 l3)
(at p11 l2)
(at p12 l1)
(at p13 l0)
(at p14 l1)
(at p15 l1)
)

(:goal
(and
(at p0 l0)
(at p1 l0)
(at p2 l1)
(at p3 l1)
(at p4 l3)
(at p5 l2)
(at p6 l1)
(at p7 l0)
(at p8 l0)
(at p9 l1)
(at p10 l0)
(at p11 l1)
(at p12 l2)
(at p13 l1)
(at p14 l0)
(at p15 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l3)
   deleted: (at p9 l3)
   added: (in p9 t0)
   goals met: 0 of 16
2. (drive t0 l3 l1 level74 level13 level87)
   deleted: (at t0 l3) (fuel t0 level87)
   added: (at t0 l1) (fuel t0 level74)
   goals met: 0 of 16
3. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 1 of 16
4. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 1 of 16
5. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 1 of 16
6. (load p15 t0 l1)
   deleted: (at p15 l1)
   added: (in p15 t0)
   goals met: 1 of 16
7. (load p14 t0 l1)
   deleted: (at p14 l1)
   added: (in p14 t0)
   goals met: 1 of 16
8. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 1 of 16
9. (drive t0 l1 l3 level61 level13 level74)
   deleted: (at t0 l1) (fuel t0 level74)
   added: (at t0 l3) (fuel t0 level61)
   goals met: 1 of 16
10. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 2 of 16
11. (load p10 t0 l3)
   deleted: (at p10 l3)
   added: (in p10 t0)
   goals met: 2 of 16
12. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 2 of 16
13. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 2 of 16
14. (drive t0 l3 l0 level46 level15 level61)
   deleted: (at t0 l3) (fuel t0 level61)
   added: (at t0 l0) (fuel t0 level46)
   goals met: 2 of 16
15. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 3 of 16
16. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 4 of 16
17. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 5 of 16
18. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 5 of 16
19. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 5 of 16
20. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 5 of 16
21. (load p13 t0 l0)
   deleted: (at p13 l0)
   added: (in p13 t0)
   goals met: 5 of 16
22. (drive t0 l0 l2 level33 level13 level46)
   deleted: (at t0 l0) (fuel t0 level46)
   added: (at t0 l2) (fuel t0 level33)
   goals met: 5 of 16
23. (load p11 t0 l2)
   deleted: (at p11 l2)
   added: (in p11 t0)
   goals met: 5 of 16
24. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 5 of 16
25. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 5 of 16
26. (unload p12 t0 l2)
   deleted: (in p12 t0)
   added: (at p12 l2)
   goals met: 6 of 16
27. (unload p15 t0 l2)
   deleted: (in p15 t0)
   added: (at p15 l2)
   goals met: 7 of 16
28. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 8 of 16
29. (drive t0 l2 l0 level20 level13 level33)
   deleted: (at t0 l2) (fuel t0 level33)
   added: (at t0 l0) (fuel t0 level20)
   goals met: 8 of 16
30. (unload p14 t0 l0)
   deleted: (in p14 t0)
   added: (at p14 l0)
   goals met: 9 of 16
31. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 10 of 16
32. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 11 of 16
33. (drive t0 l0 l1 level11 level9 level20)
   deleted: (at t0 l0) (fuel t0 level20)
   added: (at t0 l1) (fuel t0 level11)
   goals met: 11 of 16
34. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 12 of 16
35. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 13 of 16
36. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 14 of 16
37. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 15 of 16
38. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 16 of 16
